NEW_ORDER_TG_MSG = "✅ *Новая заявка!*\n" \
                   "№ {order_id} от {datetime}\n\n" \
                   "👤 *Имя:* {first_name}\n\n" \
                   "📱 *Телефон:* {phone}\n\n" \
                   "📍 *Адрес:* {address}\n\n" \
                   "💬 *Комментарий:*\n{comment}"

SUCCESS_ORDER_CREATION_MSG = "Заявка №{} успешно создана!"
SUCCESS_ORDER_CREATION_SUB_MSG = "{}, мы свяжемся с вами в ближайшее время!"
ERROR_ORDER_CREATION_MSG = "Не получилось создать заявку"

PHONE_MIN_LENGTH_ERROR_MSG = "Номер телефона должен содержать не меньше 11 цифр"
PHONE_MAX_LENGTH_ERROR_MSG = "Номер телефона должен содержать не больше 11 цифр"

